tutorials/surfaceTracking/interTrackFoam/hydrofoil/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
bottom
{
    type wall;
    nFaces 310;
    startFace 14213;
}

hydrofoil
{
    type wall;
    nFaces 34;
    startFace 14523;
}

freeSurface
{
    type patch;
    nFaces 310;
    startFace 14557;
}

outlet
{
    type patch;
    nFaces 4;
    startFace 14867;
}

inlet
{
    type patch;
    nFaces 4;
    startFace 14871;
}

frontAndBackPlanes
{
    type empty;
    nFaces 14544;
    startFace 14875;
}
)

// ************************************************************************* //
